src/ExternalDataProcessors/КонструкторМоделиЗапросаSQL/КонструкторМоделиЗапросаSQL.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExternalDataProcessor>
  <name>КонструкторМоделиЗапросаSQL</name>
  <attributes>
    <name>ТекстЗапроса</name>
    <type>
      <types>TextDocument</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстМодели</name>
    <type>
      <types>TextDocument</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСУБД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяБазыДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АутентификацияNTLM</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СмещениеДат2000</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатJSON</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнятьНаСервере</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:ExternalDataProcessor>

src/ExternalDataProcessors/КонструкторМоделиЗапросаSQL/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ПолучитьТекстЗапроса(Команда)
	ПолучитьТекстЗапросаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьТекстЗапросаНаСервере()
	//@skip-check module-unused-local-variable
	Перем Результат;
	Если ЗначениеЗаполнено(Объект.РезультатJSON) Тогда
		Результат = ОбщийКлиентСервер.JSONВОбъект(Объект.РезультатJSON);
	КонецЕсли;
	МодельЗапросаSQL = Обработки.МодельЗапросаSQL.Создать();
	МодельЗапроса = МодельЗапросаSQL;
	//@skip-check server-execution-safe-mode
	Выполнить(Объект.ТекстМодели.ПолучитьТекст());
	Объект.ТекстЗапроса.УстановитьТекст(МодельЗапросаSQL.ПолучитьТекстЗапросаПакета());	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуМакетПеречисления(Команда)
	ОбщийКлиент.ОткрытьФормуПоИмени(ЭтотОбъект, "МакетПеречисления");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.ТипСУБД = "SQLServer";
	Объект.АутентификацияNTLM = Истина;
	Объект.СмещениеДат2000 = Истина;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ВыполнитьЗапрос(ТекстЗапроса, ПараметрыСоединения)
	СоединениеADODB = РаботаС_ADODB.Соединение(
		ПараметрыСоединения.ТипСУБД, 
		ПараметрыСоединения.Сервер, 
		ПараметрыСоединения.ИмяБазыДанных, 
		ПараметрыСоединения.ИмяПользователя, 
		ПараметрыСоединения.Пароль, 
		ПараметрыСоединения.АутентификацияNTLM
	);
	Таблица = РаботаС_ADODB.ВыполнитьЗапрос(СоединениеADODB, ТекстЗапроса);
	РаботаС_ADODB.ЗакрытьСоединение(СоединениеADODB);
	Возврат Таблица;
КонецФункции

&НаСервере
Процедура КомандаВыполнитьЗапросНаСервере()
	ТекстЗапроса = Объект.ТекстЗапроса.ПолучитьТекст(); 
	ПараметрыСоединения = РаботаС_ADODB.ПараметрыСоединения();
	ЗаполнитьЗначенияСвойств(ПараметрыСоединения, Объект);
	Таблица = ВыполнитьЗапрос(ТекстЗапроса, ПараметрыСоединения);
	Если Таблица = Неопределено Тогда
		Объект.РезультатJSON = "";
		Возврат;
	КонецЕсли;
	Объект.РезультатJSON = ОбщийКлиентСервер.ОбъектВJSON(Таблица);
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыполнитьЗапрос(Команда)
	Если Объект.ВыполнятьНаСервере Тогда
		КомандаВыполнитьЗапросНаСервере();
		Возврат;
	КонецЕсли;
	ТекстЗапроса = Объект.ТекстЗапроса.ПолучитьТекст(); 
	ПараметрыСоединения = РаботаС_ADODB.ПараметрыСоединения();
	ЗаполнитьЗначенияСвойств(ПараметрыСоединения, Объект);
	Таблица = ВыполнитьЗапрос(ТекстЗапроса, ПараметрыСоединения);
	Если Таблица = Неопределено Тогда
		Объект.РезультатJSON = "";
		Возврат;
	КонецЕсли;
	Объект.РезультатJSON = ОбщийКлиентСервер.ОбъектВJSON(Таблица);
КонецПроцедуры

&НаСервере
Процедура ВывестиЗаголовок(ТабличныйДокумент, Заголовок)
	Секция = ТабличныйДокумент.ПолучитьОбласть("R1");
	Секция.Область("R1C1").Текст = Заголовок;
	ТабличныйДокумент.Вывести(Секция);
КонецПроцедуры

&НаСервере
Процедура ВывестиТаблицу(ТабличныйДокумент, Таблица, Заголовок)
	ВывестиЗаголовок(ТабличныйДокумент, Заголовок);	
	Построитель = Новый ПостроительОтчета;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(Таблица);       
	Построитель.Вывести(ТабличныйДокумент);
КонецПроцедуры

&НаСервере
Функция ПолучитьРезультат()
	Таблица = Общий.СтруктураВТаблицуЗначений(Объект.РезультатJSON);
	Результат = Новый ТабличныйДокумент;
	ВывестиТаблицу(Результат, Таблица, "Результат");
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура Печать(Команда)
	Результат = ПолучитьРезультат();
	Результат.Показать();
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостьюДоступностью()
	Элементы.ГруппаНастройки.Заголовок = СтрШаблон("Сервер: %1, БД: %2", Объект.Сервер, Объект.ИмяБазыДанных);
	Элементы.КомандаПоказатьРезультат.Пометка = ПоказыватьРезультат;
	Элементы.РезультатJSON.Видимость = ПоказыватьРезультат;
КонецПроцедуры

&НаКлиенте
Процедура СерверПриИзменении(Элемент)
	УправлениеВидимостьюДоступностью();
КонецПроцедуры

&НаКлиенте
Процедура ИмяБазыДанныхПриИзменении(Элемент)
	УправлениеВидимостьюДоступностью();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеВидимостьюДоступностью();
КонецПроцедуры

&НаКлиенте
Процедура КомандаПоказатьРезультат(Команда)
	ПоказыватьРезультат = НЕ ПоказыватьРезультат;
	УправлениеВидимостьюДоступностью();
КонецПроцедуры
